# Mode Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
TransactionAttribute..::..Mode Property
TransactionAttribute Class See Also
---
Transaction mode.
**Namespace:** Autodesk.Revit.Attributes**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2011
# Syntax
C#
---
```text
public TransactionMode Mode { get; }
```

Visual Basic
---
```text
Public ReadOnly Property Mode As TransactionMode
	Get
```

Visual C++
---
```text
public:
property TransactionMode Mode {
	TransactionMode get ();
}
```

# See Also
TransactionAttribute Class
Autodesk.Revit.Attributes Namespace